Table of Contents
 Class Extensions
Namespace
IdeaStatiCa.Plugin.Grpc.Reflection
Assembly
IdeaStatiCa.Plugin.dll
public static class Extensions
Inheritance
object
Extensions
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Methods
 FromVal(GrpcReflectionArgument, object)
public static GrpcReflectionArgument FromVal(this GrpcReflectionArgument src, object value)
Parameters
src GrpcReflectionArgument
value object
Returns
GrpcReflectionArgument
 FromVal(GrpcReflectionCallbackData, object)
public static GrpcReflectionCallbackData FromVal(this GrpcReflectionCallbackData src, object value)
Parameters
src GrpcReflectionCallbackData
value object
Returns
GrpcReflectionCallbackData
 Edit this page